users/jack/emacs/emacs.org
#+title: Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

* Core
** Lexical binding
By default all variables are dynamically looked up in one global table. This creates a new environment of variables for each scope (function, let expression, etc) like more modern languages
#+begin_src emacs-lisp
  ;; -*- lexical-binding: t; -*-
#+end_src

** Startup performance
Measure and tweak startup performance.
#+begin_src emacs-lisp
  ;; The default is 800 kilobytes.  Measured in bytes.
  (setq gc-cons-threshold (* 100 1000 1000))

  (defun jdr/display-startup-time ()
    (message "Emacs loaded in %s with %d garbage collections."
             (format "%.2f seconds"
                     (float-time
                      (time-subtract after-init-time before-init-time)))
             gcs-done))

  (add-hook 'emacs-startup-hook #'jdr/display-startup-time)
#+end_src

** Basic UI setup
#+begin_src emacs-lisp
  ;; visual stuff
  (setq inhibit-startup-message t)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (menu-bar-mode -1)
  (set-default 'truncate-lines t)

  ;; base font setup
  (setq font-use-system-font t)
  (let ((default-font-height (if (eq system-type 'darwin) 150 110)))
    (set-face-attribute 'default nil :height default-font-height))

  ;; Enable line numbering in `prog-mode'
  (add-hook 'prog-mode-hook #'display-line-numbers-mode)
#+end_src

** Package setup
Don't let emacs manage it's own plugins, from the [[https://nixos.org/manual/nixos/stable/index.html#module-services-emacs-configuring][emacs section of the nix manual]].
#+begin_src emacs-lisp
  (require 'package)
  ;; makes unpure packages archives unavailable
  (setq package-archives nil)
  (setq package-enable-at-startup nil)
  (package-initialize)
#+end_src

** Auto-tangle Configuration Files
Auto tangle any org files located in my =.emacs.d= directory, not a perfect hook, but close enough. A modified version of [[https://github.com/daviwil/emacs-from-scratch/blob/master/Emacs.org#auto-tangle-configuration-files][this config in emacs from scratch]].
#+begin_src emacs-lisp
  ;; Automatically tangle our Emacs.org config file when we save it
  ;; FIXME don't hardcode nixfiles directory
  (defun jdr/org-babel-tangle ()
    (when (string-equal (file-name-directory buffer-file-name)
                        (expand-file-name "~/nixfiles/users/jack/emacs/"))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'jdr/org-babel-tangle)))
#+end_src

** Theme
#+begin_src emacs-lisp
  (setq modus-themes-bold-constructs t
        modus-themes-italic-constructs t
        modus-themes-fringes 'subtle
        modus-themes-paren-match '(intense)
        modus-themes-prompts '(bold intense)
        modus-themes-completions 'opinionated
        modus-themes-org-blocks 'tinted-background
        modus-themes-scale-headings t
        modus-themes-region '(bg-only)
        modus-themes-syntax '(yellow-comments)
        modus-themes-headings
        '((1 . (overline background 1.4))
          (2 . (background 1.3))
          (3 . (bold 1.2))
          (t . (semilight 1.1))))
  ;; Load the light theme by default
  (load-theme 'modus-operandi t)
#+end_src

** Keeping =.emacs.d= clean
Use the [[https://github.com/emacscollective/no-littering/blob/master/no-littering.el][no-littering]] package to keep the Emacs configuration folder clean! It knows about a wide variety of variables for built in Emacs features as well as those from community packages so it can be much easier than finding and setting these variables manually.
#+begin_src emacs-lisp
  (use-package no-littering)
  ;; no-littering doesn't set this by default so we must place
  ;; auto save files in the same path as it uses for sessions
  (setq auto-save-file-name-transforms
        `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
#+end_src

** Misc other setup stuff
#+begin_src emacs-lisp
  ;; NOTE: The first time you load your configuration on a new machine, you'll
  ;; need to run the following command interactively so that mode line icons
  ;; display correctly:

  ;; M-x all-the-icons-install-fonts
  (use-package all-the-icons)

  (use-package doom-modeline
    :ensure t
    :init (doom-modeline-mode 1))

  (recentf-mode t)
  (setq recentf-max-saved-items 50)
#+end_src

** Autopair brackets
Built-in and relatively smart auto pairing of brackets and quotes.
Disable auto-pairing of =<= in org mode because it messes with [[*Org structured templates][structured templates]]. See [[https://emacs.stackexchange.com/questions/26225/dont-pair-quotes-in-electric-pair-mode][this stack overflow question]] for how it works.
#+begin_src emacs-lisp
  (electric-pair-mode 1)

  (add-hook
   'org-mode-hook
   (lambda ()
     (setq-local electric-pair-inhibit-predicate
                 `(lambda (c)
                    (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c))))))
  #+end_src

** Help
#+begin_src emacs-lisp
  (use-package helpful
    :bind
    ([remap describe-command] . helpful-command)
    ([remap describe-key] . helpful-key)
    :config
    (global-set-key (kbd "C-c C-d") #'helpful-at-point))

  ;; modes with variable width font (docs + help)
  (dolist (mode '(help-mode-hook
                  helpful-mode-hook))
    (add-hook mode (lambda () (variable-pitch-mode))))
#+end_src

** Pulse on actions
This pulses on most text changes, at first glance I thought it would be too much but so far I'm really liking it. Even if I end up turning it down or off, it would be awesome to have on while pairing.
#+begin_src emacs-lisp
  (use-package evil-goggles
    :ensure t
    :after evil
    :config
    (evil-goggles-mode)
    (evil-goggles-use-diff-faces))
#+end_src

** Undo system
Use the built in undo-redo system, and the basic =vundo= package to visualise the undo tree.
#+begin_src emacs-lisp
  (use-package vundo
    :config
    (setq vundo-glyph-alist vundo-unicode-symbols))
#+end_src

* Project management stuff
** Project.el
=C-x p p= to open project switcher
#+begin_src emacs-lisp
  (defun project-vterm ()
    "Start a new vterm in project root (based on `project-shell`)"
    (interactive)
    (let* ((default-directory (project-root (project-current t)))
	   (default-project-vterm-name (project-prefixed-buffer-name "vterm"))
	   (vterm-buffer (get-buffer default-project-vterm-name)))
      (if (and vterm-buffer (not current-prefix-arg))
	  (pop-to-buffer-same-window vterm-buffer)
	(vterm (generate-new-buffer-name default-project-vterm-name)))))

  (use-package project
    :config
    (add-to-list 'project-switch-commands '(project-vterm "VTerm"))
    (add-to-list 'project-switch-commands '(magit-project-status "Magit"))
    :bind (("C-x p t" . project-vterm)
	   ("C-x p m" . magit-project-status)))
#+end_src

* Minibuffer completions
Covers minibuffer completions, for completion at point look under the [[*Lsp][lsp section]]
#+begin_src emacs-lisp
  (use-package vertico
    :init
    (vertico-mode)
    (setq vertico-cycle t))

  (use-package marginalia
    :config
    (marginalia-mode 1))

  ;; Persist history over Emacs restarts. Vertico sorts by history position.
  (use-package savehist
    :init
    (savehist-mode))

  ;; A few more useful configurations...
  (use-package emacs
    :init
    ;; Add prompt indicator to `completing-read-multiple'.
    ;; Alternatively try `consult-completing-read-multiple'.
    (defun crm-indicator (args)
      (cons (concat "[CRM] " (car args)) (cdr args)))
    (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

    ;; Do not allow the cursor in the minibuffer prompt
    (setq minibuffer-prompt-properties
          '(read-only t cursor-intangible t face minibuffer-prompt))
    (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

    ;; Emacs 28: Hide commands in M-x which do not work in the current mode.
    ;; Vertico commands are hidden in normal buffers.
    (setq read-extended-command-predicate
          #'command-completion-default-include-p)

    ;; Enable recursive minibuffers
    (setq enable-recursive-minibuffers t))

  ;; Optionally use the `orderless' completion style.
  (use-package orderless
    :init
    (setq completion-styles '(orderless basic)
          completion-category-defaults nil
          completion-category-overrides '((file (styles partial-completion)))))

#+end_src

* Keymaps
** Evil core
This section sets up evil behaving enough like vanilla vim for me
#+begin_src emacs-lisp
  (use-package evil
    :ensure t
    :custom
    (evil-want-keybinding nil)
    (evil-want-C-u-scroll t)
    (evil-undo-system 'undo-redo)
    (evil-want-Y-yank-to-eol t)
    (evil-split-window-below t)
    (evil-vsplit-window-right t)
    :config
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)

    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'messages-buffer-mode 'normal))

  ;; Make ESC quit prompts
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
  ;; Since I let evil-mode take over C-u for buffer scrolling, I need to re-bind
  ;; the universal-argument command to another key sequence
  (global-set-key (kbd "C-M-u") 'universal-argument)
#+end_src

