users/jack/emacs/emacs.org
** Evil extras
All the additional evil packages that are basically required
#+begin_src emacs-lisp
  (use-package evil-collection
    :after evil
    :ensure t
    :custom
    (evil-collection-calendar-want-org-bindings t)
    (evil-collection-setup-minibuffer t)
    :config
    (evil-collection-init))

  (use-package evil-numbers
    :after evil
    :ensure t
    :config
    (define-key evil-normal-state-map (kbd "C-a") 'evil-numbers/inc-at-pt)
    (define-key evil-normal-state-map (kbd "C-c +") 'evil-numbers/inc-at-pt)
    (define-key evil-normal-state-map (kbd "C-c -") 'evil-numbers/dec-at-pt))

  (use-package evil-org
    :ensure t
    :after org
    :hook (org-mode . (lambda () evil-org-mode))
    :config
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys))

  (use-package evil-surround
    :ensure t
    :after evil
    :config
    (global-evil-surround-mode 1))

  (use-package evil-commentary
    :ensure t
    :after evil
    :config (evil-commentary-mode))
#+end_src

** Evil window movements
Make evil window movements less strict, by default they're only =C-w {h,j,k,l}=, so if you don't let go of =ctrl= fast enough it doesn't work. This also aligns with vim's default behaviour.
#+begin_src emacs-lisp
  (evil-define-key 'normal 'global (kbd "C-w C-h") 'evil-window-left)
  (evil-define-key 'normal 'global (kbd "C-w C-j") 'evil-window-down)
  (evil-define-key 'normal 'global (kbd "C-w C-k") 'evil-window-up)
  (evil-define-key 'normal 'global (kbd "C-w C-l") 'evil-window-right)
#+end_src

** Keymaps
#+begin_src emacs-lisp
  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 0.3))

  (use-package general
    :init
    (setq general-override-states
          '(insert emacs hybrid normal visual motion operator replace))
    :config
    (general-create-definer rune/leader-keys
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC")
    (general-create-definer rune/quick-keys
      :keymaps '(normal)
      :prefix ","))

  (rune/leader-keys
    "p" project-prefix-map
    "gs" 'magit-status
    "hf" 'helpful-function
    "hv" 'helpful-variable
    "hk" 'helpful-key)

  ;; setup avy like my hop.nvim setup
  (use-package avy
    :after evil
    :config
    (evil-define-key 'normal 'global "s" 'evil-avy-goto-char))

  ;; quick keymaps like my vim setup
  (rune/quick-keys
    "b" 'consult-buffer
    "B" 'consult-project-buffer
    "f" 'find-file
    "l" 'consult-line
    "o" 'consult-recent-file
    "a" 'deadgrep
    "x" 'execute-extended-command)

  (use-package deadgrep)
  (use-package consult)
  ;; (use-package embark) ;; yeah?
  
#+end_src

* Org
** Core
#+begin_src emacs-lisp
  (defun jdr/org-mode-setup ()
    (add-hook 'org-babel-after-execute-hook 'org-redisplay-inline-images)
    (org-indent-mode 1)
    (visual-line-mode 1)

    (setq
     ;; Agenda styling
     ;; org-agenda-block-separator ?─
     org-agenda-time-grid
     '((daily today require-timed)
       (800 1000 1200 1400 1600 1800 2000)
       " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
     org-agenda-current-time-string
     "⭠ now ─────────────────────────────────────────────────")

    ;; override variable pitch fonts selectively
    (variable-pitch-mode 1)
    (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    )

  (use-package org
    :hook (org-mode . jdr/org-mode-setup)
    :bind (("C-c l" . org-store-link))
    :custom
    (org-startup-with-inline-images t)
    (org-confirm-babel-evaluate nil)
    (org-auto-align-tags nil)
    (org-tags-column 0)
    (org-catch-invisible-edits 'show-and-error)
    (org-special-ctrl-a/e t)
    (org-insert-heading-respect-content t)
    (org-pretty-entities t)
    (org-ellipsis "…")
    (org-agenda-start-with-log-mode t)
    (org-log-into-drawer t)
    (org-directory "~/org/")
    (org-agenda-files '("~/org/" "~/org/logbook"))
    (org-archive-location "~/org/archive")
    (org-todo-keywords
     '((sequence "TODO(t)" "IN-PROGRESS(p!)" "WAITING(w@/!)"
                 "|" "DONE(d!)" "CANCELLED(c!)")))
    :config
    ;; load org stuff up front rather than on the first time an org file is opened
    (org-load-modules-maybe t))
    #+end_src

** Org journal
=C-c C-j= is the default binding for ~org-journal-new-entry~, but we need to bind it in org-mode as this is ~org-goto~ by default.
#+begin_src emacs-lisp
  (use-package org-journal
    :ensure t
    :config
    (define-key org-mode-map (kbd "C-c C-j") 'org-journal-new-entry)
    (global-set-key (kbd "C-c C-S-j") 'org-journal-open-current-journal-file)
    (setq org-journal-dir "~/Documents/org/logbook/"
          org-journal-file-type 'weekly
          org-journal-file-format "week-%W.journal.org"
          org-journal-enable-agenda-integration t))
#+end_src

** Org babel
#+begin_src emacs-lisp
  (use-package mermaid-mode)
  (use-package ob-mermaid)

  (with-eval-after-load 'org
    (add-to-list 'org-src-lang-modes '("plantuml" . plantuml))
    (add-to-list 'org-src-lang-modes '("javascript" . js))
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (js . t)
       (shell . t)
       (python . t)
       (mermaid . t)
       (latex . t)
       (plantuml . t)))

    (push '("conf-unix" . conf-unix) org-src-lang-modes))
#+end_src

** Org structured templates
Org Mode’s structure templates feature enables you to quickly insert code blocks into your Org files in combination with org-tempo by typing =<= followed by the template name like =el= or py and then press =TAB=. For example, to insert an empty emacs-lisp block below, you can type =<el= and press =TAB= to expand into such a block.
#+begin_src emacs-lisp
  (with-eval-after-load 'org
    ;; This is needed as of Org 9.2
    (require 'org-tempo)

    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("py" . "src python"))
    (add-to-list 'org-structure-template-alist '("js" . "src js")))
#+end_src

** Max width and center org files
#+begin_src emacs-lisp
  (defun jdr/org-mode-visual-fill ()
    (setq visual-fill-column-width 100
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (org-mode . jdr/org-mode-visual-fill))
#+end_src

* Completion at point
#+begin_src emacs-lisp
  (use-package corfu
    :custom
    (corfu-auto t)
    (corfu-auto-delay 0)
    (corfu-echo-documentation nil)
    (corfu-cycle t)
    :init
    (global-corfu-mode))

  ;; TODO render markdown from lsp? or is that an eglot thing?
  (use-package corfu-doc
    :config
    (add-hook 'corfu-mode-hook #'corfu-doc-mode))
#+end_src

* Languages
** Lsp
#+begin_src emacs-lisp
  (use-package eglot
    :custom
    (eldoc-echo-area-use-multiline-p nil))

  (use-package flymake
    :bind (("M-n" . flymake-goto-next-error)
           ("M-p" . flymake-goto-prev-error)))
#+end_src

** Tree sitter
#+begin_src emacs-lisp
  (use-package tree-sitter
    :ensure t
    :config
    (global-tree-sitter-mode)
    (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode))

  (use-package tree-sitter-langs
    :ensure t
    :after tree-sitter)

  (use-package evil-textobj-tree-sitter
    :after evil
    :config
    (define-key evil-outer-text-objects-map "c"
      (evil-textobj-tree-sitter-get-textobj "class.outer"))
    (define-key evil-inner-text-objects-map "c"
      (evil-textobj-tree-sitter-get-textobj "class.inner"))
    (define-key evil-outer-text-objects-map "f"
      (evil-textobj-tree-sitter-get-textobj "function.outer"))
    (define-key evil-inner-text-objects-map "f"
      (evil-textobj-tree-sitter-get-textobj "function.inner")))
#+end_src

** Formatting
#+begin_src emacs-lisp
  (use-package apheleia
    :config
    (add-to-list 'apheleia-formatters '(nixfmt . ("nixfmt")))
    (add-to-list 'apheleia-mode-alist '(nix-mode . nixfmt))
    (apheleia-global-mode +1))
#+end_src

** Typescript
#+begin_src emacs-lisp
  (use-package typescript-mode
    :mode "\\.ts\\'\\|\\.tsx\\'"
    :hook (typescript-mode . eglot-ensure)
    :config
    (setq typescript-indent-level 2))
#+end_src

** Nix
#+begin_src emacs-lisp
  (use-package nix-mode
    :hook (nix-mode . eglot-ensure)
    :mode "\\.nix\\'")
#+end_src

** Rust
#+begin_src emacs-lisp
  (use-package rust-mode
    :hook (rust-mode . eglot-ensure)
    :custom
    ;; apheleia 1.2 doesn't work with rustfmt, so use rust-mode's formatting
    (rust-format-on-save t))
#+end_src

** Go
#+begin_src emacs-lisp
  (use-package go-mode
    :hook (go-mode . eglot-ensure))
#+end_src

** Shell
#+begin_src emacs-lisp
  (use-package flymake-shellcheck
    :init
    (add-hook 'sh-mode-hook 'flymake-shellcheck-load))
#+end_src

