users/jack/emacs/init.el

(use-package evil-collection
  :after evil
  :ensure t
  :custom
  (evil-collection-calendar-want-org-bindings t)
  (evil-collection-setup-minibuffer t)
  :config
  (evil-collection-init))

(use-package evil-numbers
  :after evil
  :ensure t
  :config
  (define-key evil-normal-state-map (kbd "C-a") 'evil-numbers/inc-at-pt)
  (define-key evil-normal-state-map (kbd "C-c +") 'evil-numbers/inc-at-pt)
  (define-key evil-normal-state-map (kbd "C-c -") 'evil-numbers/dec-at-pt))

(use-package evil-org
  :ensure t
  :after org
  :hook (org-mode . (lambda () evil-org-mode))
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))

(use-package evil-surround
  :ensure t
  :after evil
  :config
  (global-evil-surround-mode 1))

(use-package evil-commentary
  :ensure t
  :after evil
  :config (evil-commentary-mode))

(evil-define-key 'normal 'global (kbd "C-w C-h") 'evil-window-left)
(evil-define-key 'normal 'global (kbd "C-w C-j") 'evil-window-down)
(evil-define-key 'normal 'global (kbd "C-w C-k") 'evil-window-up)
(evil-define-key 'normal 'global (kbd "C-w C-l") 'evil-window-right)

(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 0.3))

(use-package general
  :init
  (setq general-override-states
        '(insert emacs hybrid normal visual motion operator replace))
  :config
  (general-create-definer rune/leader-keys
    :keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "C-SPC")
  (general-create-definer rune/quick-keys
    :keymaps '(normal)
    :prefix ","))

(rune/leader-keys
  "p" project-prefix-map
  "gs" 'magit-status
  "hf" 'helpful-function
  "hv" 'helpful-variable
  "hk" 'helpful-key)

;; setup avy like my hop.nvim setup
(use-package avy
  :after evil
  :config
  (evil-define-key 'normal 'global "s" 'evil-avy-goto-char))

;; quick keymaps like my vim setup
(rune/quick-keys
  "b" 'consult-buffer
  "B" 'consult-project-buffer
  "f" 'find-file
  "l" 'consult-line
  "o" 'consult-recent-file
  "a" 'deadgrep
  "x" 'execute-extended-command)

(use-package deadgrep)
(use-package consult)
;; (use-package embark) ;; yeah?

(defun jdr/org-mode-setup ()
  (add-hook 'org-babel-after-execute-hook 'org-redisplay-inline-images)
  (org-indent-mode 1)
  (visual-line-mode 1)

  (setq
   ;; Agenda styling
   ;; org-agenda-block-separator ?─
   org-agenda-time-grid
   '((daily today require-timed)
     (800 1000 1200 1400 1600 1800 2000)
     " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
   org-agenda-current-time-string
   "⭠ now ─────────────────────────────────────────────────")

  ;; override variable pitch fonts selectively
  (variable-pitch-mode 1)
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  )

(use-package org
  :hook (org-mode . jdr/org-mode-setup)
  :bind (("C-c l" . org-store-link))
  :custom
  (org-startup-with-inline-images t)
  (org-confirm-babel-evaluate nil)
  (org-auto-align-tags nil)
  (org-tags-column 0)
  (org-catch-invisible-edits 'show-and-error)
  (org-special-ctrl-a/e t)
  (org-insert-heading-respect-content t)
  (org-pretty-entities t)
  (org-ellipsis "…")
  (org-agenda-start-with-log-mode t)
  (org-log-into-drawer t)
  (org-directory "~/org/")
  (org-agenda-files '("~/org/" "~/org/logbook"))
  (org-archive-location "~/org/archive")
  (org-todo-keywords
   '((sequence "TODO(t)" "IN-PROGRESS(p!)" "WAITING(w@/!)"
               "|" "DONE(d!)" "CANCELLED(c!)")))
  )

(use-package org-journal
  :ensure t
  :config
  (define-key org-mode-map (kbd "C-c C-j") 'org-journal-new-entry)
  (global-set-key (kbd "C-c C-S-j") 'org-journal-open-current-journal-file)
  (setq org-journal-dir "~/Documents/org/logbook/"
        org-journal-file-type 'weekly
        org-journal-file-format "week-%W.journal.org"
        org-journal-enable-agenda-integration t))

(use-package mermaid-mode)
(use-package ob-mermaid)

(with-eval-after-load 'org
  (add-to-list 'org-src-lang-modes '("plantuml" . plantuml))
  (add-to-list 'org-src-lang-modes '("javascript" . js))
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (js . t)
     (shell . t)
     (python . t)
     (mermaid . t)
     (latex . t)
     (plantuml . t)))

  (push '("conf-unix" . conf-unix) org-src-lang-modes))

(with-eval-after-load 'org
  ;; This is needed as of Org 9.2
  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("js" . "src js")))

(defun jdr/org-mode-visual-fill ()
  (setq visual-fill-column-width 100
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . jdr/org-mode-visual-fill))

(use-package corfu
  :custom
  (corfu-auto t)
  (corfu-auto-delay 0)
  (corfu-echo-documentation nil)
  (corfu-cycle t)
  :init
  (global-corfu-mode))

;; TODO render markdown from lsp? or is that an eglot thing?
(use-package corfu-doc
  :config
  (add-hook 'corfu-mode-hook #'corfu-doc-mode))

(use-package eglot
  :custom
  (eldoc-echo-area-use-multiline-p nil))

(use-package flymake
  :bind (("M-n" . flymake-goto-next-error)
         ("M-p" . flymake-goto-prev-error)))

(use-package tree-sitter
  :ensure t
  :config
  (global-tree-sitter-mode)
  (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode))

(use-package tree-sitter-langs
  :ensure t
  :after tree-sitter)

(use-package apheleia
  :config
  (add-to-list 'apheleia-formatters '(nixfmt . ("nixfmt")))
  (add-to-list 'apheleia-mode-alist '(nix-mode . nixfmt))
  (apheleia-global-mode +1))

(use-package typescript-mode
  :mode "\\.ts\\'\\|\\.tsx\\'"
  :hook (typescript-mode . eglot-ensure)
  :config
  (setq typescript-indent-level 2))

(use-package nix-mode
  :hook (nix-mode . eglot-ensure)
  :mode "\\.nix\\'")

(use-package rust-mode
  :hook (rust-mode . eglot-ensure)
  :custom
  ;; apheleia 1.2 doesn't work with rustfmt, so use rust-mode's formatting
  (rust-format-on-save t))
