users/jack/emacs/emacs.org
** PlantUML
Currently only using this in org source blocks, and it's not working yet. But will be nice to have around once it is.
#+begin_src emacs-lisp
  (use-package plantuml-mode)
  (setq plantuml-executable-path "/usr/bin/plantuml")
  (setq org-plantuml-executable-path "/usr/bin/plantuml")
  (setq plantuml-default-exec-mode 'executable)
  (setq org-plantuml-exec-mode 'executable)
#+end_src

* VCS and Magit
#+begin_src emacs-lisp
  (use-package magit)
#+end_src

* Terminals
** TODO setup eshell
** Vterm
Setup fish colors so they match my current theme (modus-operandi), this is quite brittle because it depends on me using fish and my current emacs theme, but it works okay for now. Colors were calculated using functions from [[https://github.com/snyball/emacs-fish-colors][synball/emacs-fish-colors.]]
#+begin_src emacs-lisp
  (use-package vterm
    :custom
    (vterm-environment
     '("fish_term24bit=1"
       "fish_color_autosuggestion=#505050"
       "fish_color_cancel=#a60000"
       "fish_color_command=#5317ac"
       "fish_color_comment=#505050"
       "fish_color_cwd=#000000"
       "fish_color_cwd_root=#000000"
       "fish_color_end=#000000"
       "fish_color_error=#a60000"
       "fish_color_escape=#000000"
       "fish_color_history_current=#000000"
       "fish_color_host=#000000"
       "fish_color_host_remote=#000000"
       "fish_color_match=#000000"
       "fish_color_normal=#000000"
       "fish_color_operator=#721045"
       "fish_color_param=#000000"
       "fish_color_quote=#2544bb"
       "fish_color_redirection=#721045"
       "fish_color_search_match=#000000"
       "fish_color_selection=#000000"
       "fish_color_status=#000000"
       "fish_color_user=#000000")))
#+end_src

* Snippets
** Tempel config
#+begin_src emacs-lisp
  (use-package tempel
    :bind (("C-j" . tempel-expand)
           ("C-l" . tempel-next)
           ("M-+" . tempel-complete)
           ("M-*" . tempel-insert))
    :custom
    (tempel-path "~/.emacs.d/templates.el")
    :init
    (defun tempel-setup-capf ()
      (setq-local completion-at-point-functions
                  (cons #'tempel-expand
                        completion-at-point-functions)))
    (add-hook 'prog-mode-hook 'tempel-setup-capf)
    (add-hook 'text-mode-hook 'tempel-setup-capf))
#+end_src

** Snippet definitions
*** Set filetype
Adds syntax highlighting if file is opened directly.
#+begin_src lisp-data :tangle ./templates.el
  ;;; -*- lisp-data -*-
#+end_src

*** Fundimental and prog modes
#+begin_src lisp-data :tangle ./templates.el
  fundamental-mode ;; Available everywhere

  (today (format-time-string "%Y-%m-%d"))

  prog-mode

  (fixme (if (derived-mode-p 'emacs-lisp-mode) ";; " comment-start) "FIXME ")
  (todo (if (derived-mode-p 'emacs-lisp-mode) ";; " comment-start) "TODO ")
  (bug (if (derived-mode-p 'emacs-lisp-mode) ";; " comment-start) "BUG ")
  (hack (if (derived-mode-p 'emacs-lisp-mode) ";; " comment-start) "HACK ")
#+end_src

*** Org mode
These are still just examples from the tempel repo, can do better than this.
#+begin_src lisp-data :tangle ./templates.el
  org-mode

  (title "#+title: " p n "#+author: Daniel Mendler" n "#+language: en" n n)
  (quote "#+begin_quote" n r n "#+end_quote")
  (example "#+begin_example" n> r> n> "#+end_example")
  (center "#+begin_center" n> r> n> "#+end_center")
  (comment "#+begin_comment" n> r> n> "#+end_comment")
  (verse "#+begin_verse" n> r> n> "#+end_verse")
  (src "#+begin_src " p n> r> n> "#+end_src" :post (org-edit-src-code))
  (elisp "#+begin_src emacs-lisp" n> r> n "#+end_src" :post (org-edit-src-code))
#+end_src
*** Lisp modes
These are still just examples from the tempel repo, probably get rid of most
#+begin_src lisp-data :tangle ./templates.el
  lisp-mode emacs-lisp-mode ;; Specify multiple modes

  (lambda "(lambda (" p ")" n> r> ")")

  emacs-lisp-mode

  (autoload ";;;###autoload")
  (pt "(point)")
  (lambda "(lambda (" p ")" n> r> ")")
  (var "(defvar " p "\n  \"" p "\")")
  (local "(defvar-local " p "\n  \"" p "\")")
  (const "(defconst " p "\n  \"" p "\")")
  (custom "(defcustom " p "\n  \"" p "\"" n> ":type '" p ")")
  (face "(defface " p " '((t :inherit " p "))\n  \"" p "\")")
  (group "(defgroup " p " nil\n  \"" p "\"" n> ":group '" p n> ":prefix \"" p "-\")")
  (macro "(defmacro " p " (" p ")\n  \"" p "\"" n> r> ")")
  (alias "(defalias '" p " '" p ")")
  (fun "(defun " p " (" p ")\n  \"" p "\"" n> r> ")")
  (iflet "(if-let (" p ")" n> r> ")")
  (whenlet "(when-let (" p ")" n> r> ")")
  (iflet* "(if-let* (" p ")" n> r> ")")
  (whenlet* "(when-let* (" p ")" n> r> ")")
  (andlet* "(and-let* (" p ")" n> r> ")")
  (cond "(cond" n "(" q "))" >)
  (pcase "(pcase " (p "scrutinee") n "(" q "))" >)
  (let "(let (" p ")" n> r> ")")
  (let* "(let* (" p ")" n> r> ")")
  (rec "(letrec (" p ")" n> r> ")")
  (dotimes "(dotimes (" p ")" n> r> ")")
  (dolist "(dolist (" p ")" n> r> ")")
  (loop "(cl-loop for " p " in " p " do" n> r> ")")
  (command "(defun " p " (" p ")\n  \"" p "\"" n> "(interactive" p ")" n> r> ")")
  (advice "(defun " (p "adv" name) " (&rest app)" n> p n> "(apply app))" n>
          "(advice-add #'" (p "fun") " " (p ":around") " #'" (s name) ")")
  (provide "(provide '" (file-name-base (or (buffer-file-name) (buffer-name))) ")" n
           ";;; " (file-name-nondirectory (or (buffer-file-name) (buffer-name))) " ends here" n)
#+end_src
