users/jack/emacs/init.el

(use-package plantuml-mode)
(setq plantuml-executable-path "/usr/bin/plantuml")
(setq org-plantuml-executable-path "/usr/bin/plantuml")
(setq plantuml-default-exec-mode 'executable)
(setq org-plantuml-exec-mode 'executable)

(use-package magit)

(use-package vterm
  :custom
  (vterm-environment
   '("fish_term24bit=1"
     "fish_color_autosuggestion=#505050"
     "fish_color_cancel=#a60000"
     "fish_color_command=#5317ac"
     "fish_color_comment=#505050"
     "fish_color_cwd=#000000"
     "fish_color_cwd_root=#000000"
     "fish_color_end=#000000"
     "fish_color_error=#a60000"
     "fish_color_escape=#000000"
     "fish_color_history_current=#000000"
     "fish_color_host=#000000"
     "fish_color_host_remote=#000000"
     "fish_color_match=#000000"
     "fish_color_normal=#000000"
     "fish_color_operator=#721045"
     "fish_color_param=#000000"
     "fish_color_quote=#2544bb"
     "fish_color_redirection=#721045"
     "fish_color_search_match=#000000"
     "fish_color_selection=#000000"
     "fish_color_status=#000000"
     "fish_color_user=#000000")))

(use-package tempel
  :bind (("C-j" . tempel-expand)
         ("C-l" . tempel-next)
         ("M-+" . tempel-complete)
         ("M-*" . tempel-insert))
  :custom
  (tempel-path "~/.emacs.d/templates.el")
  :init
  (defun tempel-setup-capf ()
    (setq-local completion-at-point-functions
                (cons #'tempel-expand
                      completion-at-point-functions)))
  (add-hook 'prog-mode-hook 'tempel-setup-capf)
  (add-hook 'text-mode-hook 'tempel-setup-capf))
